morse = {'A': '.-', 'B': '-...', 'C': '-.-.',
         'D': '-..', 'E': '.', 'F': '..-.',
         'G': '--.', 'H': '....', 'I': '..',
         'J': '.---', 'K': '-.-', 'L': '.-..',
         'M': '--', 'N': '-.', 'O': '---',
         'P': '.--.', 'Q': '--.-', 'R': '.-.',
         'S': '...', 'T': '-', 'U': '..-',
         'V': '...-', 'W': '.--', 'X': '-..-',
         'Y': '-.--', 'Z': '--..', ' ': '\t'}
decode = {'.-': 'A', '-...': 'B', '-.-.': 'C', '-..': 'D', '.': 'E', '..-.': 'F', '--.': 'G', '....': 'H',
          '..': 'I', '.---': 'J', '-.-': 'K', '.-..': 'L', '--': 'M', '-.': 'N', '---': 'O', '.--.': 'P',
          '--.-': 'Q', '.-.': 'R', '...': 'S', '-': 'T', '..-': 'U', '...-': 'V', '.--': 'W', '-..-': 'X',
          '-.--': 'Y',
          '--..': 'Z'}


def main():
    while True:  # спрашиваем у пользователя, какую операцию совершить
        opp = input('Если вы хотите закодировать текст в формат Морзе, введите "1",\n'
                    'Если вы хотите раскодировать текст из Морзе, введите "2",\n'
                    'Для выхода из программы введите "выход".\n')
        if opp == '1':
            print(encode_to_morse(input('Введите код для шифровки: ')))
            print()
        elif opp == '2':
            print(decode_from_morse(input('Введите код для расшифровки: ')))
            print()
        elif opp == 'выход':
            exit()
        else:
            print('Некорректный ввод!')


main()

